function [rz, ry, rx] = dcm_to_angle(Cbn)
%  [rz, ry, rx] = dcm_angle(Cbn)
%  Преобразует матрицу направляющих косинусов в углы Эйлера
%
%   Входные аргументы:
%   Cbn -  матрица направляющих косинусов [3,3]
%
%   Выходные аргументы:
%   rz, ry, rx - углы Эйлера вокруг осей Z, Y и X соответственно

rz = atan2(Cbn(1, 2), Cbn(1, 1));

% Разрешение неоднозначности 
if (Cbn(1, 3) ^ 2 < 1.0)
    ry = -atan2(Cbn(1, 3), sqrt(1 - Cbn(1, 3) ^ 2));
else
    ry = -atan2(Cbn(1, 3), 0);
end

rx = atan2(Cbn(2, 3), Cbn(3, 3));

end