function C = dcmnormalize(C)
%  C = dcmnormalize(C)
%  Нормализация матрицы направляющих косинусов 
%
%   Входные аргументы:
%   C -  Матрица направляющих косинусов
%
%   Выходные аргументы:
%   C -  Матрица направляющих косинусов

delta_12 = C(1, :) * C(2, :)';
C(1, :) = C(1, :) - 1/2 * delta_12 * C(2, :);
C(2, :) = C(2, :) - 1/2 * delta_12 * C(1, :);
C(3, :) = cross(C(1, :), C(2, :));
C(1, :) = C(1, :) ./ sqrt((C(1, :)) * (C(1, :))');
C(2, :) = C(2, :) ./ sqrt((C(2, :)) * (C(2, :))');
C(3, :) = C(3, :) ./ sqrt((C(3, :)) * (C(3, :))');
end
