function xe = geo_to_ecef(lat, lon, alt, a, e)
%  xe = geo2ecef(lat, lon, alt, a, e)
%  Преобразует координаты точки из географической системы координат в
% глобальную систему координат ECEF
%
%   Входные аргументы:
%   lat, lon, alt - Широта, долгота и высота точки в географической СК
%   a, e  -  параметры эллипсоида географической системы координат
%
%   Выходные аргументы:
%   xe -  Координаты точки в системе координат ECEF

Re = a / sqrt(1 - e ^ 2 * sin(lat) ^ 2);
x = (Re + alt) * cos(lat) * cos(lon);
y = (Re + alt) * cos(lat) * sin(lon);
z = (Re *(1 - e ^ 2) + alt) * sin(lat);
xe = [x; y; z];
end