function P = EKF_prediction(P, F, Q)
% Фильтр Калмана - предсказание 
%   Входные аргументы:
%   P - Матрица ковариации фильтра Калмана
%   F - Матрица динамики системы
%   Q - Матрица ковариации шумов системы
%
%   Выходные аргументы:
%   P   - Матрица ковариации фильтра Калмана

% Обновление оценки вектор состояния фильтра Калмана
% Оценка вектора x не меняется так как фильтр оцениевает ошибки,
% учитываемые и списываемые на каждом шаге работы

% Обновление матрицы ковариации фильтра Калмана
P = F * P * F' + Q;
end